Repository: magi1125/inclusive-design-pattern
Catalog: tm/chapter-13_EN-US_JA.tmx
Source language: en_us
Languages: ja

source: Altogether, deploying <article> doesn’t look very appealing, but there is a small advantage in certain contexts.
ja: 結局のところ、<article>の配置にはあまり魅力がなさそうですが、ある特定のコンテキストではちょっとした利点があります。

source: The JAWS screen reader (and only the JAWS screen reader) announces “Article” on entering the element and “Article end” on exiting it.
ja: JAWSスクリーンリーダーは（JAWSスクリーンリーダーだけは）、この要素に入るときに「＃＃Article＃＃」、出るときに「＃＃Article end＃＃」と読み上げます。

source: Arguably, this is useful information where there are several <article>s on the same page and the user is reading from top to bottom, element by element.
ja: 確かに、同じページに複数の<article>があり、ユーザーが要素ごとに上から下に向かって読んでいる場合には、これは有益な情報です。

source: The following markup is serviceable for a blog’s homepage, where multiple recent posts are listed.
ja: 以下のマークアップは、複数の最近の記事がリストされるブログのホームページに役立ちます。

source: <article> <!-- first article’s content here --> </article> <article> <!-- second article’s content here --> </article> <article> <!-- third article’s content here --> </article>
ja: <article> <!—ここが1つ目の記事のコンテンツ --> </article> <article> <!—ここが2つ目の記事のコンテンツ --> </article> <article> <!—ここが3つ目の記事のコンテンツ --> </article>

source: Try to think in terms of user experience when choosing semantic elements.
ja: セマンティックな要素を選ぶときは、ユーザー体験の点から考えるようにしましょう。

source: Sometimes they may be the technically correct element to use, but they’re not supported in any way so have no impact on anyone.
ja: 技術的には正しい要素を使用していても、サポートされていないため誰にも影響しないこともあります。

source: Other times they do have an impact but the part they play is confusing, inconsistent or obstructive.
ja: また、効果がある場合でも、その役割が分かりにくかったり、一貫性がなかったり、邪魔だったりする場合もあります。

source: In her talk “Burn Your Select Tags8” (video), Alice Bartlett shares the research she undertook at the UK Government Digital Service9 into <select> element usability.
ja: アリス・バートレット（Alice Bartlett）は、「Burn Your Select Tags」（ビデオ）（脚注43）の中で、UK Government Digital Service（脚注44）で彼女が行った<select>要素のユーザービリティの調査について話しています。

source: Universally implemented and semantic though it is, there’s compelling evidence that you should avoid using the <select> element wherever possible.
ja: この要素は広く実装されておりセマンティックはありますが、可能な限り<select>要素の使用を避けるべき強力な根拠があります。

source: Not only are there discrete technical shortcomings (such as certain devices suppressing the zoom of <option> overlays), but they just don’t seem to be understood by all sorts of people.
ja: 個々の技術的な欠点（特定のデバイスが<option>オーバーレイのズームを表示しないなど）があるだけではなく、あらゆる人たちに理解されてはいないようです。

source: Progressive Enhancement And Interoperability
ja: プログレッシブエンハンスメントとインターオペラビリティ

source: The sound semantic structure we’ve been fostering in our blog article doesn’t just benefit screen reader users.
ja: ここまでにブログ記事で作り上げてきた音声のセマンティック構造は、スクリーンリーダーユーザーにのみメリットをもたらすわけではありません。

source: If a browser fails to load your style sheet, it will still differentiate key elements of the interface using its own default user agent style sheet.
ja: ブラウザがスタイルシートの読み込みに失敗した場合でも、独自のデフォルトユーザーエージェントのスタイルシートを使用して、インターフェイスの主要な要素を区別します。

source: Headings, for instance, will appear in bold text and have font sizes indicative of the section depth they represent.
ja: たとえば、見出しは太字テキストで表示され、それらが表すセクションの深さを示すフォントサイズになります。

source: In addition, services that syndicate your content, such as feed readers, will be able to apply their own structural styles, enabling a comfortable reading experience within their own applications.
ja: さらに、フィードリーダーなどのコンテンツをまとめるサービスは、独自の構造スタイルを適用し、それぞれのアプリケーション内で読みやすくすることができます。

source: Content that works well in different contexts and via different inputs can be said to be interoperable.
ja: さまざまなコンテキストで、さまざまな入力を介して問題なく機能するコンテンツは、相互運用性があると言うことができます。

source: Good semantic structure works well with screen readers, feed readers, search engines and all sorts of other parsers looking for structural meaning in your content.
ja: 優れたセマンティック構造は、スクリーンリーダー、フィードリーダー、サーチエンジン、およびコンテンツ内の構造的な意味を検索する他のあらゆるパーサーで正しく機能します。

source: A good way to test that your content has a sound structure is to turn CSS off and see if the page is still readable.
ja: コンテンツに音声構造があることをテストする良い方法は、CSSをオフにしてもページが読めるかどうかを確認することです。

source: Are the order and hierarchy apparent?
ja: 順序や階層は明確ですか？

source: Is the page still navigable and usable?
ja: ページのナビゲートや使用は可能なままですか？

source: A Note on Single-Page Applications
ja: シングルページアプリケーションについて

source: Single-page applications are typified by their use of client-side JavaScript to render and rerender content.
ja: シングルページアプリケーションは、クライアント側のJavaScriptを使用してコンテンツを描画および再描画するのが特徴です。

source: Where content is subject to a lot of change as a result of user interaction, this approach enables an immediacy not possible when making round-trips to the server.
ja: ユーザー操作の結果として、コンテンツに多くの変更が生じるケースでは、このアプローチをとれば、サーバーとの往復を行った場合には得られない迅速さが実現します。

source: However, when the content you are serving is static and intended for reading alone, relying on client-side JavaScript to render that content is an underperforming and relatively unreliable method.
ja: しかし、提供しようとしているコンテンツが静的で、読むことだけを目的としたものである場合、クライアント側のJavaScriptを使用してコンテンツを表示するのは、非効率で、比較的信頼性の低い方法です。

source: Content should be available to users who do not have JavaScript running or for whom JavaScript has thrown an error, been blocked or failed to load.
ja: コンテンツはJavaScriptを実行していないユーザーや、JavaScriptがエラーを報告したり、ブロックされたり、読み込みに失敗したりしたユーザーにも利用できるようにすべきです。

source: Providing server-rendered content also means that content will be found by folks using search engines, and is parsable by third parties using command line tools like cURL10.
ja: また、サーバーが描画するコンテンツを提供することは、サーチエンジンの利用者がそのコンテンツを見つけられること、またcURLなどのコマンドラインツールを使用するサードパーティが解析可能であることを意味します。

source: It’s for all these reasons that Tantek Çelik11, cofounder of the IndieWeb movement, believes JavaScript-dependent static content is not in keeping with web design fundamentals.
ja: （脚注45）こうした理由から、？？IndieWeb？？ムーブメントの創始者の1人であるタンテック・チェリック（Tantek Çelik）は、JavaScript依存の静的コンテンツはWebデザインの基礎に則っていないと考えています。【コメント：定訳が確認できませんでした】

source: In short:
ja: 要約すると以下のようになります。

source: “If it’s not curlable, it’s not on the web.” – “js;dr = JavaScript required; Didn’t Read12,” Tantek Çelik
ja: 「curlできなければ、Web上にはない」 —「js;dr = JavaScript required; Didn’t Read」、タンテック・チェリック（Tantek Çelik）（脚注46）

source: When a site like smashingmagazine.com13 sends prerendered content to the client, I can print that content to my console using the curl command.
ja: smashingmagazine.comなどのサイトが、事前に描画されたコンテンツをクライアントに送る場合、curlコマンドを使用することで、自分のコンソールにそのコンテンツを出力できます。

source: If JavaScript was used to construct the content in the client, all I would see is the code for the outer web page, with its link(s) to the JavaScript which curl is unable to run.
ja: クライアントでコンテンツを構築するのにJavaScriptが使用されている場合、表示されるのはcurlを実行することができないJavaScriptへのリンクを持つ、外側のWebページのコードだけです。

source: Flesch-Kincaid Readability Tests
ja: Flesch-Kincaidリーダビリティテスト

source: In “A Paragraph” I offered some basic guidance on writing easily digestible body text.
ja: 「パラグラフ」では、理解しやすい本文テキストの書き方について、基本的なガイダンスを説明しました。

source: Now that we’re putting a few paragraphs together within a blog article, it’s probably a good time to review the readability of your content.
ja: 1つのブログ記事内にいくつかのパラグラフをまとめているところなので、コンテンツの読みやすさを見直すのに良いタイミングでしょう。

source: There are two tests you can perform on your content which assess word, sentence and paragraph length to determine the readability of your text.
ja: コンテンツに対して実行できる、単語、文章、パラグラフの長さを評価してテキストの読みやすさを判定するテストは2つあります。

source: The Flesch reading ease test gives you a score between 0 and 100 where a higher score means more easily readable and, therefore, more inclusive of different readers.
ja: Flesch Reading Easeテストでは、0～100点で評価されます。得点が高いほどより簡単に読める、つまりより多様な読者についてインクルーシブであるという意味です。

source: The Flesch-Kincaid grade level test is similar but produces a US school grade level.
ja: Flesch- Kincaid Grade Levelテストもこれと似ていますが、米国の学校の学年で評価します。

source: The idea is that the younger the audience who can successfully read it, the more readable it is.
ja: より若い読者が読めるほど、より読みやすいという考え方です。

source: Here’s a summary from the tests’ Wikipedia page14:
ja: 以下はこのテストのWikipediaページからの要約です。（脚注47）

source: Score
ja: 得点

source: School Level
ja: 学年

source: Notes
ja: 注釈

source: 5th grade
ja: 5年生

source: Very easy to read.
ja: 非常に読みやすい。

source: Easily understood by an average 11-year-old student.
ja: 平均的な11才の生徒が容易に理解できる。

source: 6th grade
ja: 6年生

source: Easy to read.
ja: 読みやすい。

source: Conversational English for consumers.
ja: 会話に使われる英語。

source: 7th grade
ja: 7年生

source: Fairly easy to read.
ja: わりと読みやすい。

source: 8th & 9th grade
ja: 8および9年生

source: Plain English.
ja: 平易な英語。

source: Easily understood by 13- to 15-year-old students.
ja: 平均的な13～15才の生徒が容易に理解できる。

source: 10th to 12th grade
ja: 10～12年生

source: Fairly difficult to read.
ja: わりと読みにくい。

source: college
ja: 大学生

source: Difficult to read.
ja: 読みにくい。

source: college graduate
ja: 大学卒業

source: Very difficult to read.
ja: 非常に読みにくい。

source: Best understood by university graduates.
ja: 大学卒業者が最も理解できる。

source: There are a number of tools to test your content against Flesch-Kincaid, including the TRAY readability tool15 (a Chrome browser extension) or, if you want something to run from the command line, I’ve created Readability Checker CLI16 — a Node.js CLI (command line interface).
ja: TRAYリーダビリティツール（脚注48）（Chromeブラウザ拡張）など、Flesch-Kincaidを基準としてコンテンツをテストするツールはいくつかあります。また、コマンドラインからテストを実行したい場合には、私が作成したReadability Checker CLI（脚注49）があります。これはNode.js CLI（コマンドラインインターフェイス）です。

source: Just install readability-checker globally and point it at a web page.
ja: readability-checkerをグローバルにインストールして、Webページを指定してください。

source: Here’s what it will return:
ja: 以下が返されます。

source: •Flesch reading ease score (out of 100; higher means more readable).
ja: • Flesch Reading Easeの得点（100点満点、高いほど読みやすい）

source: •Notes about the score.
ja: • 得点に関する注記

source: •A list of the longer words (more than four syllables).
ja: • 長い単語のリスト（5音節以上）

source: •A list of the longer sentences (more than 35 words).
ja: • 長い文章のリスト（36単語以上）

source: Recently, products like Tenon17 have begun to emerge: quality assurance tools focused on accessibility and inclusion.
ja: 最近、Tenon（脚注50）など、アクセシビリティとインクルーシブを焦点とした品質保証ツールの製品が登場しました。

source: Amid a maintenance-centric quality assurance culture largely designed by developers for developers, this is most welcome.
ja: 開発者が主に開発者のためにデザインしてきた、保守を中心とする品質保証文化の中で、これは非常に歓迎すべきことです。

source: If poor code style like inconsistent indentation breaks a build, that’s one thing; but if a build breaks because the product is in danger of alienating a user?
ja: まず1つには、一貫しないインデントなど、お粗末なコードスタイルがあればビルドが壊れます。では、成果物がユーザーを疎外する危険があるためにビルドが壊れるとしたらどうでしょう？

source: All the better.
ja: ますます結構なことです。

source: I see no reason why poor readability should not also be considered a point of failure.
ja: 読みやすさが劣っていることも1つの障害点とみなすべきだと私は思います。

source: Note, however, that readability is rather subjective.
ja: ただし、この読みやすさはかなり主観的であることに注意してください。

source: Scientific though a formula for determining readability may sound, you cannot rely on Flesch-Kinkaid tests alone.
ja: 読みやすさを判定する公式は科学的であるように見えるかもしれませんが、Flesch-Kinkaidテストだけに頼ることはできません。

source: Use them as an early warning system to highlight potential issues, and test with real users as well.
ja: これらは、潜在する問題を浮き彫りにするための早い段階での警告システムとして使用し、実際のユーザーでもテストしてください。

source: Heading And Link Text
ja: 見出しとリンクテキスト

source: If you work as a front-end engineer, you are no doubt familiar with the virtues of modular design.
ja: フロントエンドエンジニアであれば、モジュール式デザインの長所についてよくご存じでしょう。

source: By creating reusable modules (or components), you can develop more rapidly, with tried-and-tested code, and eliminate redundancy.
ja: 再利用可能なモジュール（コンポーネント）を作成することで、十分に試行されたコードを使用して、より迅速に開発を進め、重複を避けることができます。

source: A good module has an independent purpose that can be lent seamlessly to a number of different contexts.
ja: 適切なモジュールには、多様なコンテキストでシームレスに役立つ、独立した目的があります。

source: For the purposes of inclusive design, sometimes our text has to have a certain autonomy as well.
ja: インクルーシブデザインでは、テキストにある程度の自律性が求められる場合があります。

source: Take the following heading as an example:
ja: 以下の見出しを例にとってみましょう。

source: Free, you say?
ja: 無料ですって？

source: Then yes, please!
ja: それでは、ください！

source: In the context of surrounding paragraph text, it is no doubt possible to infer what the heading is referring to.
ja: 周囲のパラグラフテキストのコンテキストがあれば、見出しが何を指しているか推測することは間違いなく可能でしょう。

source: That is, reading from the previous section into this one, you’d have a good idea of what is free.
ja: つまり、前のセクションからこのセクションへ読み進めることで、何が無料なのかが分かるはずです。

source: But this isn’t much help in a table of contents, listing headings outside of body text.
ja: しかし、本文テキストの外側に見出しをリストした目次ではそういうわけにはいきません。

source: What’s free?
ja: 何が無料なのでしょう？

source: Direct, descriptive headings clarify the ensuing content, which aids comprehension across the board.
ja: 直接的で分かりやすい見出しは、それに続くコンテキストを明確にし、全体的な理解も助けます。

source: In other words, being cryptic or whimsical doesn’t get you very far!
ja: つまり、もったいぶった見出しや風変わりな見出しに、あまりメリットはないのです！

source: There’s also a specific implication for screen reader users: screen readers tend to catalog headings dynamically and offer them as a list to choose from.
ja: さらに、スクリーンリーダーユーザーにとってはある意味合いがあります。

source: For instance, in NVDA, I can open the Elements List dialog with Insert + F7 and browse a list of headings on the page.
ja: スクリーンリーダーは、動的に見出しをカタログ化し、選択できるリストとして提供します。

source: Running VoiceOver you can open the rotor (Ctrl + Option + U on Mac OS X) and see headings listed in a similar fashion.
ja: たとえば、NVDAでは、Insert + F7キーで＃＃Elements List＃＃ダイアログを開き、ページの見出しのリストを見ることができます。

source: Accordingly, the following heading content would be of greater utility (at least if this section of the blog article is indeed about flapjacks, otherwise it would be rather misleading!).
ja: VoiceOverでは、ローター（Mac OS X上でCtrl + Option + U）を開いて、同じようにリストされた見出しを見ることができます。したがって、以下の見出しコンテンツの方がずっと便利でしょう。（少なくともブログ記事のこのセクションが本当にフラップジャックに関するものであれば。そうでなければ誤解を招きます！）

source: Free flapjacks, you say?
ja: フラップジャックが無料ですって？

source: Yes, please!
ja: ください！

source: Obnoxious Link Labels
ja: 不快なリンクラベル

source: Links, like headings, are made available as a list in NVDA’s elements dialog, and other screen readers aggregate them in a similar fashion.
ja: 見出しと同じく、リンクもNVDAの要素ダイアログにリストとして提供されます。他のスクリーンリーダーもこれらを同じような形で集約します。

source: Like headings, link text should be autonomously meaningful.
ja: 見出しと同様に、リンクテキストもそれ自体で意味が分かるようにすべきです。

source: You may have encountered the habit of bloggers using runs of inline links like so:
ja: 以下のように、インラインリンクを点々と使用する癖のあるブロガーを見たことがあるのではないでしょうか。

source: I have a lot of support to back up my amazing ideas!
ja: ？？私の素晴らしいアイデアには、これを支える多 く の裏付けがある。？？【コメント：英語のままにするか迷いました。原文「I have a lot of support to back up my amazing ideas!」】

source: Cute, but each link has an entirely meaningless label when taken out of context, not to mention that even read sequentially “a link lot link of link” doesn’t tell us anything useful.
ja: かわいらしいですが、コンテキストから取り出してみると、各リンクには、まったく意味のないラベルが付いています。順番に「？？多リンクくリンクのリンク？？」と読んでも、何も分からないことは言うまでもありません。【コメント：上の例文に合わせて日本語にしましたがこれで問題ないでしょうか。原文「a link lot link of link」】

source: In addition, it’s not always clear visually that there are separate links present.
ja: 加えて、個別のリンクが存在することが、視覚的にも明確であるとは限りません。

source: That depends on you identifying breaks in the underline.
ja: アンダーラインの途切れが発見（認識）されるかどうかにかかっています。

source: It’s even worse if you haven’t actually provided a link underline.
ja: 実際にリンクアンダーラインを提供していなければ、もっと悪いことになります。

source: If you’re going to cite the work of other authors, the polite thing to do is mention their works by name.
ja: 他の著者の著作物を引用するのであれば、名前でこれに言及するのが礼儀です。

source: The links in the following example all indicate where they actually take you, and the commas — plus the “and” — help to separate them.
ja: 以下の例のリンクはすべて、実際のリンク先の場所を示しており、？？読点と「そして」？？がそれぞれを区別するのに役立っています。【コメント：次の例文を日本語にしたのでそれに合わせた記述にしました。英語のままにするなら「コンマと「and」」となります。原文「commas — plus the “and” —」】

source: I have a lot of support to back up my amazing ideas, including Why Heydon Is Right by John Thoughtleader, In Support Of Heydon by Jane Unicornfield, and When Heydon Talks It’s Like He Vomits Fragrant Rainbows by Harry Surname.
ja: 私の素晴らしいアイデアには、これを支える多くの裏付けがある。たとえば、John Thoughtleader氏の「WhyHeydon Is Right」、JaneUnicornfield氏の「In Support Of Heydon」、そしてHarrySurname氏の「WhenHeydonTalks It’s Like HeVomitsFragrantRainbows」などだ。

source: Video
ja: ビデオ

source: As a writer, it is the differentiation and clarification of runs and blocks of words that still excites me most about HTML, old news though this basic feature is.
ja: ？？ライターの私がHTMLについて今でも最もワクワクするのは、単語の並びや塊を差別化および明確化することです。この基本的な機能は目新しいものではありませんが。？？【コメント：不安訳です。原文「As a writer, it is the differentiation and clarification of runs and blocks of words that still excites memost about HTML, old news though this basic feature is.」】

source: But I appreciate that not everyone is a confident writer or an avid reader.
ja: しかし、すべての人が自信あふれるライターや熱心な読者であるわけではないということは理解しています。

source: The addition of images, sound and video to blog posts gives color and variety to content, as well as providing more options to those with different abilities and preferences, or in different circumstances.
ja: 画像、サウンド、ビデオをブログ記事に加えることで、コンテンツに色や多様性が加わるだけでなく、さまざまな能力や好みを持つ人たち、または多様な環境にいる人たちに、より多くの選択肢を提供できます。

source: Take video.
ja: ビデオを例にとりましょう。

source: Sometimes it’s just better to be shown rather than told about how something works.
ja: 何かの仕組みを伝えるとき、言葉で説明するよりも、見せた方が良い場合があります。

source: It’s simply a better way of learning certain things.
ja: これは何かを学ぶのに良い方法です。

source: Other times I might want to be told but not shown, because I need to be looking at something different at the same time.
ja: また、同時に何か他の物を見る必要があるために、見せられるのではなく、言葉で説明して欲しいときもあります。

source: For example, while I’m working on a visual design for something, I might want to simultaneously listen to the dialog from a conference talk video.
ja: たとえば、何かの視覚デザインに取り組みながら、同時にカンファレンスのトークビデオの会話を聞き取りたいと思うことがあります。

source: On a bus, and without a set of headphones handy, I might want to be shown and told, but without blaring audio at my fellow passengers.
ja: バスに乗っていて、ヘッドフォンもないときに、見ながらトークを聞きたいけれど、他の乗客の前で大きな音を鳴らすことは避けたいという場合もあるでしょう。

source: Furthermore, watching speakers in the video with captions also available can assist me as a non-native speaker.
ja: さらに、キャプション付きのビデオで話し手を見られれば、ネイティブスピーカーでない人の助けになるでしょう。

source: A well-captioned video is just the ticket.
ja: 良いキャプションの付けられたビデオなら、まさにおあつらえ向きです。

source: Of course, having captions also caters for those who are deaf and hard of hearing, but not just them.
ja: もちろん、キャプションがあれば、聴力に問題のある人たちの役に立ちます。でもそれだけではありません。

source: It’s better to see captions as simply “another way to consume the same content.” Then you get a better idea of just how many people can make use of them.
ja: 「同じコンテンツを利用するもう1つの方法」として、キャプションが見られた方が良いのです。そう考えると、どれだけ多くの人が利用できるかよく分かるでしょう。

source: But captions are only available if the video itself can be downloaded or streamed.
ja: しかし、キャプションはビデオそのものをダウンロードまたはストリーミングできる場合にしか利用できません。

source: This is why video that contains dialog should always be accompanied by a transcript.
ja: このため、会話を含むビデオには常にトランスクリプトを付けるべきです。

source: A video blog post should feature the video prominently, but provide a transcript of the video underneath it.
ja: ビデオブログ記事では、ビデオを目立つように表示すべきですが、その下にビデオのトランスクリプトを提供した方が良いでしょう。

source: Here are a few pointers on posting videos.
ja: 以下は、ビデオをポストするときのアドバイスです。

source: The Player
ja: プレイヤー

source: Make sure the video player is keyboard and screen reader accessible.
ja: ビデオプレイヤーがキーボードおよびスクリーンリーダーでアクセスできることを確認します。

source: The fastest way to know if a player is worthy of your use is to try tabbing into it with your keyboard.
ja: プレイヤーが使用にふさわしいかどうか見極める最も迅速な方法は、キーボードでプレイヤーにタブを移動してみることです。

source: If you find focus bypasses the player altogether, then game over.
ja: フォーカスがプレイヤーを飛ばしてしまう場合はゲームオーバーです。

source: Retreat.
ja: そのプレイヤーはやめて

source: Find another player.
ja: 別のプレイヤーを探しましょう。

source: Second prize for Worst Keyboard Accessibility Implementation goes to players which you can tab into and use, but without any visual feedback.
ja: キーボードアクセシビリティ実装のワースト第2位は、タブでアクセスして使用できるけれども、視覚的なフィードバックが一切ないものです。

source: Remember the “Indicating Focus” section in the last chapter?
ja: 前章の「フォーカスを示す」を思い出してください。

source: In short: no focus styles, no good.
ja: 簡単に言うと、フォーカススタイルがないのはダメです。

source: That said, if the various player controls are implemented in HTML and CSS and you can provide your own focus styles, the player may be salvageable.
ja: ただし、さまざまなプレイヤーコントロールがHTMLとCSSに実装されていて、自分なりのフォーカススタイルを提供できれば、そのプレイヤーは救いようがあるかもしれません。

source: That is, if it’s screen reader accessible too.
ja: それは、そのスクリーンリーダーもアクセスできることが条件です。

source: To get up and running with screen reader testing, I recommend you do the following:
ja: スクリーンリーダーのテストを開始するには、以下を行うことをお勧めします。

source: •Install the free NVDA screen reader18 for Windows.
ja: • Windowsの場合、無償のNVDAスクリーンリーダー（脚注51）をインストールする

source: •Run it with Firefox exclusively (for maximum compatibility).
ja: • これをFirefoxのみで実行する（互換性を最大にするため）

source: •Watch this excellent video introduction from Deque Systems19.
ja: • Deque Systems（脚注52）のこの素晴らしいビデオ紹介を見る。

source: •Refer to this list of NVDA keyboard commands20 from WebAIM.
ja: • WebAIMで、NVDAキーボードコマンド（脚注53）のリストを参照する。

source: •Remember that your experience as a screen reader user will differ dramatically from blind users, who have dramatically different strategies even among themselves.
ja: • 皆さんのスクリーンリーダーユーザーとしての体験は、視覚障害者の体験とは劇的に異なるものになることに注意する。視覚障害者の中でも方策はそれぞれ非常に異なります

source: (Refer to the responses of my screen reader survey21 to gain an impression of the diversity.)
ja: （私のスクリーンリーダー調査（脚注54）の回答を見ると、その多様性が分かります）。

source: Alternatively, if you are a Mac user, simply press Cmd + F5 to activate the built in VoiceOver screen reader and follow along with the tutorial.
ja: Macユーザーの場合は、代わりにCmd + F5を押して、組み込みのVoiceOverスクリーンリーダーをアクティブにし、チュートリアルに従ってください。

source: Make sure you use VoiceOver with Safari for the most reliable experience.
ja: 体験の信頼性を最大にするため、VoiceOverは必ずSafariで使用してください。

source: Fortunately, testing an interactive widget like a video player doesn’t require a working knowledge of the vast array of keyboard commands offered in NVDA and other readers.
ja: 幸いなことに、ビデオプレイヤーなどのインタラクティブなウィジェットをテストするのに、NVDAやその他のリーダーで提供されている膨大なキーボードコマンドに関する実用的な知識は必要ありません。

source: Just tab to the controls as you would when testing keyboard support and listen for aural feedback.
ja: キーボードサポートをテストするときは、ただコントロールにタブを移動し、音声フィードバックを聞きます。

source: For instance, the play button should say “Play button” (or similar) when focused, or “Pause button” if the video is already playing.
ja: たとえば、再生ボタンにフォーカスを合わせると「再生ボタン」（または似たような音声）、ビデオがすでに再生中の場合は「一時停止ボタン」、といった具合に読み上げられます。

source: Of course, you should make sure the button can indeed be switched from a press-to-play to a press-to-pause state.
ja: もちろん、ボタンが実際に再生と一時停止の状態を切り替えられるかどうかも確認しなくてはなりません。

source: This should work by pressing either the Space or Enter keys whether or not a screen reader is running.
ja: これは、スクリーンリーダーが実行されているかどうかに関わらず、SpaceキーまたはEnterキーを押すことで機能するはずです。

source: Recommended Players
ja: お勧めのプレイヤー

source: •YouTube’s embeddable player
ja: • YouTubeの埋め込みプレイヤー

source: •Able Player22
ja: • Able Player（脚注55）

source: •Accessible HTML5 Video Player23 (from PayPal)
ja: • AccessibleHTML5Video Player（脚注56）（PayPal）

source: •Accessible and Responsive HTML5 Video Player24 (by Laura Kalbag)
ja: • Accessible and Responsive HTML5 Video Player（脚注57）（Laura Kalbag）

source: Closed Captions
ja: クローズドキャプション

source: Closed captions are captions which exist in a separate, associated file and can be switched on or off by the user, rather than being embedded into the video itself.
ja: クローズドキャプションは、ビデオ自体には埋め込まれていないキャプション（字幕）で、関連付けられた別のファイルに存在しており、ユーザーがオンとオフを切り替えることができます。

source: You can manually add caption files to HTML5 <video>25 using a WebVTT file26 as the src of a <track> element.
ja: WebVTTファイル（脚注59）を<track>要素のsrcにすることで、HTML5 <video>（脚注58）に手動でキャプションファイルを追加することができます。
